$(document).ready(function () {
  sum = 0;
  let nightCar = 0;

  let typeCar = {
    "Легковой до 1800 кг": { price: 2000, distanse: 50 },
    "Внедорожник от 1800 кг": { price: 2500, distanse: 55 },
    "Коммерческое ТС": { price: 3000, distanse: 60 },
    "Крупная спецтехника": { price: 3500, distanse: 70 },
  };

  let nameCity = {
    Абинск: { km: 89 },
    Адлер: { km: 312 },
    Анапа: { km: 180 },
    Апшеронск: { km: 125 },
    Армавир: { km: 216 },
    Афипский: { km: 30 },
    Ахтырский: { km: 80 },
    "Белоглинский район": { km: 240 },
    Белозерный: { km: 35 },
    Белореченск: { km: 100 },
    Березовый: { km: 28 },
    Брюховецкая: { km: 102 },
    Буденовск: { km: 500 },
    Восточный: { km: 41 },
    "Выселковский район": { km: 120 },
    "Горячий Ключ": { km: 57 },
    Геленджик: { km: 186 },
    Гирей: { km: 160 },
    Гулькевичи: { km: 165 },
    Дагомыс: { km: 275 },
    Джубга: { km: 117 },
    Динская: { km: 38 },
    Дорожный: { km: 36 },
    Дружелюбный: { km: 22 },
    Ейск: { km: 265 },
    Елизаветинская: { km: 30 },
    Зеленопольский: { km: 21 },
    Знаменский: { km: 11 },
    Ильский: { km: 55 },
    Индустриальный: { km: 23 },
    Калининская: { km: 80 },
    Каневская: { km: 140 },
    Колосистый: { km: 27 },
    Копанской: { km: 37 },
    Кореновск: { km: 67 },
    Краснодар: { km: 0 },
    "Красная Поляна": { km: 355 },
    Краснодарский: { km: 28 },
    Краснолит: { km: 33 },
    Красносельский: { km: 150 },
    Кропоткин: { km: 145 },
    Крыловская: { km: 180 },
    Крымск: { km: 112 },
    Курганинск: { km: 168 },
    Курчь: { km: 240 },
    Кущёвская: { km: 210 },
    Лабинск: { km: 180 },
    Лазурный: { km: 32 },
    Ленина: { km: 11 },
    Ленинградская: { km: 185 },
    Лорис: { km: 19 },
    Майкоп: { km: 123 },
    Мостовской: { km: 205 },
    Нальчик: { km: 503 },
    Нефтегорск: { km: 140 },
    Новокубанск: { km: 205 },
    Новомихайловский: { km: 135 },
    Новопокровская: { km: 205 },
    Новороссийск: { km: 160 },
    Новый: { km: 24 },
    Октябрьский: { km: 28 },
    Отрадная: { km: 291 },
    Павловская: { km: 150 },
    Плодородный: { km: 20 },
    Победитель: { km: 28 },
    Полтавская: { km: 90 },
    Пригородный: { km: 20 },
    "Приморско-Ахтарск": { km: 160 },
    Псебай: { km: 235 },
    Пятигорск: { km: 425 },
    Разъезд: { km: 27 },
    Российский: { km: 24 },
    "Ростов-на-Дону": { km: 280 },
    Севастополь: { km: 530 },
    Северская: { km: 45 },
    Симферополь: { km: 440 },
    Сириус: { km: 321 },
    "Славянск-на-Кубани": { km: 90 },
    Сочи: { km: 286 },
    Ставрополь: { km: 297 },
    Старокорсунская: { km: 25 },
    Староминская: { km: 197 },
    Старощербиновская: { km: 230 },
    Тбилисская: { km: 112 },
    Темрюк: { km: 155 },
    Тимашёвск: { km: 80 },
    Тихорецк: { km: 155 },
    Туапсе: { km: 173 },
    Успенское: { km: 245 },
    "Усть-Лабинск": { km: 70 },
    Феодосия: { km: 345 },
    Хадыженск: { km: 130 },
    Черкесск: { km: 341 },
    Черников: { km: 45 },
    Черноморский: { km: 60 },
  };

  insertCar();
  function insertCar() {
    let html = "";
    for (type in typeCar)
      html += '<option value="' + type + '">' + type + "</option>";
    $("#calk-cartype").append(html);
  }
  insertCity();
  function insertCity() {
    let html = "";
    for (type in nameCity)
      html += '<option value="' + type + '">' + type + "</option>";
    $("#calk-city").append(html);
  }
  $(".calk").change(function () {
    let car = $("#calk-cartype").val();
    let priceCar = typeCar[car]["price"];
    let distanseCar = typeCar[car]["distanse"];
    let city = $("#calk-city").val();
    let cityDistanse = nameCity[city]["km"];

    if ($("#checkbox-1").is(":checked")) {
      nightCar = 500;
    } else {
      nightCar = 0;
    }

    let wheel = $("#chislo").val();
    let wheelPrice = wheel * 500;

    let finalPrice =
      priceCar + nightCar + wheelPrice + cityDistanse * distanseCar;
    $("#final_price").text(finalPrice);
  });
});
